In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

In [3]:
a_rows = 5
a_cols = 5
cols = tuple('ABCDE')
df = pd.DataFrame(np.random.randint(1, 10, size=(a_rows, a_cols)), columns=cols)
df

   A  B  C  D  E
0  5  9  3  1  6
1  8  5  2  1  8
2  9  4  2  7  4
3  6  4  2  6  3
4  1  5  2  9  7

In [4]:
df.loc[:, ::-1]

   E  D  C  B  A
0  6  1  3  9  5
1  8  1  2  5  8
2  4  7  2  4  9
3  3  6  2  4  6
4  7  9  2  5  1

In [5]:
df.loc[::-1]

   A  B  C  D  E
4  1  5  2  9  7
3  6  4  2  6  3
2  9  4  2  7  4
1  8  5  2  1  8
0  5  9  3  1  6

In [6]:
df.loc[::-1, :]

   A  B  C  D  E
4  1  5  2  9  7
3  6  4  2  6  3
2  9  4  2  7  4
1  8  5  2  1  8
0  5  9  3  1  6

In [7]:
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  1  5  2  9  7
1  6  4  2  6  3
2  9  4  2  7  4
3  8  5  2  1  8
4  5  9  3  1  6

In [8]:
df.rename(columns={'C':'Hobi'})

   A  B  Hobi  D  E
0  5  9     3  1  6
1  8  5     2  1  8
2  9  4     2  7  4
3  6  4     2  6  3
4  1  5     2  9  7

In [9]:
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     5       9  3     1  6
1     8       5  2     1  8
2     9       4  2     7  4
3     6       4  2     6  3
4     1       5  2     9  7

In [13]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  SkLhGUsQKc -1.031362 -0.612195       NaN -1.437315
1  B3bt3ldC8h  0.500136 -0.279702  1.048254       NaN
2  tgWBzzdgVM -0.043864 -0.189839  0.271263  0.262319
3  mj9Cli2cBT -0.295167  0.340317 -1.180997  0.435156
4  gNARIOAHxk  1.161862 -0.652718 -1.318800  1.404549

In [14]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  SkLhGUsQKc -1.031362 -0.612195       NaN -1.437315
1  B3bt3ldC8h  0.500136 -0.279702  1.048254       NaN
2  tgWBzzdgVM -0.043864 -0.189839  0.271263  0.262319
3  mj9Cli2cBT -0.295167  0.340317 -1.180997  0.435156
4  gNARIOAHxk  1.161862 -0.652718 -1.318800  1.404549

In [15]:
df_backup = df.copy(deep=True)

In [16]:
df = df.dropna(axis='columns')
df.head()

            Z
0  SkLhGUsQKc
1  B3bt3ldC8h
2  tgWBzzdgVM
3  mj9Cli2cBT
4  gNARIOAHxk

In [17]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
2  tgWBzzdgVM -0.043864 -0.189839  0.271263  0.262319
3  mj9Cli2cBT -0.295167  0.340317 -1.180997  0.435156
4  gNARIOAHxk  1.161862 -0.652718 -1.318800  1.404549
5  OkmsT3238e  1.255971 -0.782236 -0.248131  0.964623
7  ox4qGNvnYG  0.855225  0.299989 -1.914959  0.265335

In [18]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.166667
B    0.066667
C    0.133333
D    0.033333
dtype: float64

In [19]:
treshold = len(df)*0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         B         D
0  SkLhGUsQKc -0.612195 -1.437315
1  B3bt3ldC8h -0.279702       NaN
2  tgWBzzdgVM -0.189839  0.262319
3  mj9Cli2cBT  0.340317  0.435156
4  gNARIOAHxk -0.652718  1.404549

In [20]:
data = {'A':[16, 15, 18, np.nan, 12], 'B':[16, 15, 18, np.nan, 12]}
df = pd.DataFrame(data)
df

      A     B
0  16.0  16.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [21]:
df['A']

0    16.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [22]:
type(df['A'])

pandas.core.series.Series

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [25]:
df['A'].equals(df['B'])

True

In [26]:
df1 = df.copy(deep=True)
df.equals(df1)

True

In [27]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True